In [41]:
import pandas as pd

In [42]:
CCTV_Seoul = pd.read_csv('../data/01. CCTV_in_Seoul.csv',  encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [43]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [44]:
CCTV_Seoul.columns[0]

'기관명'

In [45]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [46]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [47]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls', 
                          header = 2,
                          usecols = 'B, D, G, J, N')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [48]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별', 
                          pop_Seoul.columns[1] : '인구수', 
                          pop_Seoul.columns[2] : '한국인', 
                          pop_Seoul.columns[3] : '외국인', 
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

# Pandas 기초

In [49]:
import numpy as np

In [50]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [51]:
dates = pd.date_range('20210808', periods=6)
dates

DatetimeIndex(['2021-08-08', '2021-08-09', '2021-08-10', '2021-08-11',
               '2021-08-12', '2021-08-13'],
              dtype='datetime64[ns]', freq='D')

In [52]:
df = pd.DataFrame(np.random.randint(10000, size=(6,4)), index=dates, columns=(['A','B','C','D']))
df

               A     B     C     D
2021-08-08  1664  4983  2936  1490
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373
2021-08-11  1157  7544  8615  6786
2021-08-12  6362   520  4209  1443
2021-08-13  2721  5303  1526  7503

In [53]:
df.head(3) #head는 앞에 몇개를 보여주라는 명령, default = 5

               A     B     C     D
2021-08-08  1664  4983  2936  1490
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373

In [54]:
df.index

DatetimeIndex(['2021-08-08', '2021-08-09', '2021-08-10', '2021-08-11',
               '2021-08-12', '2021-08-13'],
              dtype='datetime64[ns]', freq='D')

In [55]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [56]:
df.values

array([[1664, 4983, 2936, 1490],
       [7106, 8265, 4704, 2475],
       [5668, 4084, 7172, 5373],
       [1157, 7544, 8615, 6786],
       [6362,  520, 4209, 1443],
       [2721, 5303, 1526, 7503]])

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-08-08 to 2021-08-13
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int64
 1   B       6 non-null      int64
 2   C       6 non-null      int64
 3   D       6 non-null      int64
dtypes: int64(4)
memory usage: 240.0 bytes

In [58]:
df.describe() # 통계적 요소 확인

                A            B            C            D
count     6.00000     6.000000     6.000000     6.000000
mean   4113.00000  5116.500000  4860.333333  4178.333333
std    2573.21884  2758.705548  2634.799322  2716.287589
min    1157.00000   520.000000  1526.000000  1443.000000
25%    1928.25000  4308.750000  3254.250000  1736.250000
50%    4194.50000  5143.000000  4456.500000  3924.000000
75%    6188.50000  6983.750000  6555.000000  6432.750000
max    7106.00000  8265.000000  8615.000000  7503.000000

In [59]:
df.sort_values(by='B',ascending=False)

               A     B     C     D
2021-08-09  7106  8265  4704  2475
2021-08-11  1157  7544  8615  6786
2021-08-13  2721  5303  1526  7503
2021-08-08  1664  4983  2936  1490
2021-08-10  5668  4084  7172  5373
2021-08-12  6362   520  4209  1443

In [60]:
df

               A     B     C     D
2021-08-08  1664  4983  2936  1490
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373
2021-08-11  1157  7544  8615  6786
2021-08-12  6362   520  4209  1443
2021-08-13  2721  5303  1526  7503

In [61]:
df[:3]

               A     B     C     D
2021-08-08  1664  4983  2936  1490
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373

In [62]:
df['20210814':'20210818'] # 범위에 없어도 없다고 나오지 에러 아님 (값이 없을 뿐)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [63]:
df.loc[dates[0]] #특정 행의 값만 보는 것도 가능

A    1664
B    4983
C    2936
D    1490
Name: 2021-08-08 00:00:00, dtype: int64

In [64]:
df.loc[:,['A','C']]

               A     C
2021-08-08  1664  2936
2021-08-09  7106  4704
2021-08-10  5668  7172
2021-08-11  1157  8615
2021-08-12  6362  4209
2021-08-13  2721  1526

In [65]:
df.loc[['20210808', '20210810'],['A','C']]

               A     C
2021-08-08  1664  2936
2021-08-10  5668  7172

In [66]:
df.loc[dates[0],'A']

1664

In [68]:
df.iloc[3] # loc와 다른 점은 index를 활용

A    1157
B    7544
C    8615
D    6786
Name: 2021-08-11 00:00:00, dtype: int64

In [69]:
df.iloc[[1,2,4],[0,2]]

               A     C
2021-08-09  7106  4704
2021-08-10  5668  7172
2021-08-12  6362  4209

In [71]:
df.iloc[1:3,:]

               A     B     C     D
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373

In [72]:
df

               A     B     C     D
2021-08-08  1664  4983  2936  1490
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373
2021-08-11  1157  7544  8615  6786
2021-08-12  6362   520  4209  1443
2021-08-13  2721  5303  1526  7503

In [73]:
df[df.A > 5000] # 특정 컬럼에서만

               A     B     C     D
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373
2021-08-12  6362   520  4209  1443

In [74]:
df[df > 5000] # 전체에 대해서는 만족하지 않는 것은 NaN(Not a Number) 처리

                 A       B       C       D
2021-08-08     NaN     NaN     NaN     NaN
2021-08-09  7106.0  8265.0     NaN     NaN
2021-08-10  5668.0     NaN  7172.0  5373.0
2021-08-11     NaN  7544.0  8615.0  6786.0
2021-08-12  6362.0     NaN     NaN     NaN
2021-08-13     NaN  5303.0     NaN  7503.0

In [75]:
df2 = df.copy() # 복사할 때, 이렇게! df2=df 라고 하면, 원본은 하나(위치만 복사 됨)

In [76]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

               A     B     C     D      E
2021-08-08  1664  4983  2936  1490    one
2021-08-09  7106  8265  4704  2475    one
2021-08-10  5668  4084  7172  5373    two
2021-08-11  1157  7544  8615  6786  three
2021-08-12  6362   520  4209  1443   four
2021-08-13  2721  5303  1526  7503  three

In [77]:

df2['E'].isin(['two','four'])

2021-08-08    False
2021-08-09    False
2021-08-10     True
2021-08-11    False
2021-08-12     True
2021-08-13    False
Freq: D, Name: E, dtype: bool

In [78]:

df2[df2['E'].isin(['two','four'])] # isin을 이용하면 T/F가 반환되므로 조건에 맞는 데어터 선택가능

               A     B     C     D     E
2021-08-10  5668  4084  7172  5373   two
2021-08-12  6362   520  4209  1443  four

In [79]:
df

               A     B     C     D
2021-08-08  1664  4983  2936  1490
2021-08-09  7106  8265  4704  2475
2021-08-10  5668  4084  7172  5373
2021-08-11  1157  7544  8615  6786
2021-08-12  6362   520  4209  1443
2021-08-13  2721  5303  1526  7503

In [80]:
df.apply(np.cumsum) # 누적합 구하기

                A      B      C      D
2021-08-08   1664   4983   2936   1490
2021-08-09   8770  13248   7640   3965
2021-08-10  14438  17332  14812   9338
2021-08-11  15595  24876  23427  16124
2021-08-12  21957  25396  27636  17567
2021-08-13  24678  30699  29162  25070

In [81]:
df.apply(lambda x: x.max() - x.min()) # 람다 함수도 이용가능!

A    5949
B    7745
C    7089
D    6060
dtype: int64